IOLI-crackmes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-14 Sat 16:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="content" class="content">
<ul class="org-ul">
<li><a href="index.html">home</a></li>
</ul>
<div id="outline-container-orgbb95c6a" class="outline-2">
<h2 id="orgbb95c6a">IOLI crackmes</h2>
<div class="outline-text-2" id="text-orgbb95c6a">
<p>
Lets download them :)
</p>
<div class="org-src-container">
<pre class="src src-shell">wget https://github.com/radareorg/radare2book/raw/master/crackmes/ioli/IOLI-crackme.tar.gz <span style="font-style: italic;">\</span>
     &amp;&amp; tar xvzf ./IOLI-crackme.tar.gz
</pre>
</div>
</div>
<div id="outline-container-orgddc8821" class="outline-3">
<h3 id="orgddc8821">crackme0x00</h3>
<div class="outline-text-3" id="text-orgddc8821">
<p>
First lets see what happens when its ran.
</p>
<div class="org-src-container">
<pre class="src src-shell">./crackme0x00
</pre>
</div>

<pre class="example">
IOLI Crackme Level 0x00
Password: 
Invalid Password!
</pre>


<p>
Lets see where <code>Password:</code> is in the <code>strings</code> of the binary.
</p>
<div class="org-src-container">
<pre class="src src-shell">strings ./crackme0x00 | grep -B1 -A1 Password
</pre>
</div>

<pre class="example">
IOLI Crackme Level 0x00
Password: 
250382
Invalid Password!
Password OK :)
GCC: (GNU) 3.4.6 (Gentoo 3.4.6-r2, ssp-3.4.6-1.0, pie-8.7.10)
</pre>


<p>
Alright, there is a number there, lets use that as the password.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"250382"</span> | ./crackme0x00
</pre>
</div>

<pre class="example">
IOLI Crackme Level 0x00
Password: 
Password OK :)
</pre>
</div>
</div>
<div id="outline-container-org448c088" class="outline-3">
<h3 id="org448c088">crackme0x01</h3>
<div class="outline-text-3" id="text-org448c088">
<p>
Moving on, lets see how this one behaves when executed.
</p>
<div class="org-src-container">
<pre class="src src-shell">./crackme0x01
</pre>
</div>

<pre class="example">
IOLI Crackme Level 0x01
Password: 
Invalid Password!
</pre>

<p>
Like last time lets looks at the <code>strings</code> of the binary.
</p>
<div class="org-src-container">
<pre class="src src-shell">strings ./crackme0x01
</pre>
</div>
<p>
Not so lucky this time, lets dig in a bit more with <code>radare2</code>
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> r2pipe

<span style="font-weight: bold; font-style: italic;">f</span> = <span style="font-style: italic;">"crackme0x01"</span>
<span style="font-weight: bold; font-style: italic;">r</span> = r2pipe.<span style="font-weight: bold;">open</span>(f)
r.cmd(<span style="font-style: italic;">"aaa"</span>)
<span style="font-weight: bold;">print</span>(r.cmd(<span style="font-style: italic;">"pdf@main"</span>))
</pre>
</div>

<pre class="example" id="org1a1d2cd">
/ (fcn) main 113
|   main (int argc, char **argv, char **envp);
|           ; var unsigned int local_4h @ ebp-0x4
|           ; var int local_4h_2 @ esp+0x4
|           ; DATA XREF from entry0 (0x8048347)
|           0x080483e4      55             push ebp
|           0x080483e5      89e5           mov ebp, esp
|           0x080483e7      83ec18         sub esp, 0x18
|           0x080483ea      83e4f0         and esp, 0xfffffff0
|           0x080483ed      b800000000     mov eax, 0
|           0x080483f2      83c00f         add eax, 0xf
|           0x080483f5      83c00f         add eax, 0xf
|           0x080483f8      c1e804         shr eax, 4
|           0x080483fb      c1e004         shl eax, 4
|           0x080483fe      29c4           sub esp, eax
|           0x08048400      c70424288504.  mov dword [esp], str.IOLI_Crackme_Level_0x01 ; [0x8048528:4]=0x494c4f49 ; "IOLI Crackme Level 0x01\n" ; const char *format
|           0x08048407      e810ffffff     call sym.imp.printf         ; int printf(const char *format)
|           0x0804840c      c70424418504.  mov dword [esp], str.Password: ; [0x8048541:4]=0x73736150 ; "Password: " ; const char *format
|           0x08048413      e804ffffff     call sym.imp.printf         ; int printf(const char *format)
|           0x08048418      8d45fc         lea eax, dword [local_4h]
|           0x0804841b      89442404       mov dword [local_4h_2], eax
|           0x0804841f      c704244c8504.  mov dword [esp], 0x804854c  ; [0x804854c:4]=0x49006425 ; const char *format
|           0x08048426      e8e1feffff     call sym.imp.scanf          ; int scanf(const char *format)
|           0x0804842b      817dfc9a1400.  cmp dword [local_4h], 0x149a
|       ,=&lt; 0x08048432      740e           je 0x8048442
|       |   0x08048434      c704244f8504.  mov dword [esp], str.Invalid_Password ; [0x804854f:4]=0x61766e49 ; "Invalid Password!\n" ; const char *format
|       |   0x0804843b      e8dcfeffff     call sym.imp.printf         ; int printf(const char *format)
|      ,==&lt; 0x08048440      eb0c           jmp 0x804844e
|      ||   ; CODE XREF from main (0x8048432)
|      |`-&gt; 0x08048442      c70424628504.  mov dword [esp], str.Password_OK_: ; [0x8048562:4]=0x73736150 ; "Password OK :)\n" ; const char *format
|      |    0x08048449      e8cefeffff     call sym.imp.printf         ; int printf(const char *format)
|      |    ; CODE XREF from main (0x8048440)
|      `--&gt; 0x0804844e      b800000000     mov eax, 0
|           0x08048453      c9             leave
\           0x08048454      c3             ret

</pre>
<p>
Here is the disassembly of the <code>main</code> function of the binary, notice the <code>cmp dword [local_4h], 0x149a</code> at <code>0x0804842b</code>. This looks to be comparing <code>0x149a</code>, but <code>0x149a</code> is hex.
Using <code>radare2</code> again, it can give us all other numeric values for <code>0x149a</code>
</p>
<div class="org-src-container">
<pre class="src src-shell">r2 -c <span style="font-style: italic;">"? 0x149a"</span> --
</pre>
</div>

<pre class="example" id="org611915b">
hex     0x149a
octal   012232
unit    5.2K
segment 0000:049a
int32   5274
string  "\x9a\x14"
binary  0b0001010010011010
fvalue: 5274.0
float:  0.000000f
double: 0.000000
trits   0t21020100
</pre>
<p>
Now that we have all other numeric vlaues for <code>0x149a</code> lets try that <code>int32</code> number.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"5274"</span> | ./crackme0x01
</pre>
</div>

<pre class="example">
IOLI Crackme Level 0x01
Password: 
Password OK :)
</pre>
</div>
</div>
<div id="outline-container-org4c0aee0" class="outline-3">
<h3 id="org4c0aee0">crackme0x02</h3>
<div class="outline-text-3" id="text-org4c0aee0">
<p>
Lets start things off with looking at the output of <code>strings</code>.
</p>
<div class="org-src-container">
<pre class="src src-shell">strings ./crackme0x02
</pre>
</div>
<p>
Like last time nothing jumps out as potentially being the password, Lets review the <code>main</code> function in <code>radare2</code> again.
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">import</span> r2pipe

<span style="font-weight: bold; font-style: italic;">f</span> = <span style="font-style: italic;">"crackme0x02"</span>
<span style="font-weight: bold; font-style: italic;">r</span> = r2pipe.<span style="font-weight: bold;">open</span>(f)
r.cmd(<span style="font-style: italic;">"aaa"</span>)
<span style="font-weight: bold;">print</span>(r.cmd(<span style="font-style: italic;">"pdf@main"</span>))
</pre>
</div>

<pre class="example" id="org456ed25">
/ (fcn) main 144
|   main (int argc, char **argv, char **envp);
|           ; var unsigned int local_ch @ ebp-0xc
|           ; var signed int local_8h @ ebp-0x8
|           ; var int local_4h @ ebp-0x4
|           ; var int local_4h_2 @ esp+0x4
|           ; DATA XREF from entry0 (0x8048347)
|           0x080483e4      55             push ebp
|           0x080483e5      89e5           mov ebp, esp
|           0x080483e7      83ec18         sub esp, 0x18
|           0x080483ea      83e4f0         and esp, 0xfffffff0
|           0x080483ed      b800000000     mov eax, 0
|           0x080483f2      83c00f         add eax, 0xf
|           0x080483f5      83c00f         add eax, 0xf
|           0x080483f8      c1e804         shr eax, 4
|           0x080483fb      c1e004         shl eax, 4
|           0x080483fe      29c4           sub esp, eax
|           0x08048400      c70424488504.  mov dword [esp], str.IOLI_Crackme_Level_0x02 ; [0x8048548:4]=0x494c4f49 ; "IOLI Crackme Level 0x02\n" ; const char *format
|           0x08048407      e810ffffff     call sym.imp.printf         ; int printf(const char *format)
|           0x0804840c      c70424618504.  mov dword [esp], str.Password: ; [0x8048561:4]=0x73736150 ; "Password: " ; const char *format
|           0x08048413      e804ffffff     call sym.imp.printf         ; int printf(const char *format)
|           0x08048418      8d45fc         lea eax, dword [local_4h]
|           0x0804841b      89442404       mov dword [local_4h_2], eax
|           0x0804841f      c704246c8504.  mov dword [esp], 0x804856c  ; [0x804856c:4]=0x50006425 ; const char *format
|           0x08048426      e8e1feffff     call sym.imp.scanf          ; int scanf(const char *format)
|           0x0804842b      c745f85a0000.  mov dword [local_8h], 0x5a  ; 'Z' ; 90
|           0x08048432      c745f4ec0100.  mov dword [local_ch], 0x1ec ; 492
|           0x08048439      8b55f4         mov edx, dword [local_ch]
|           0x0804843c      8d45f8         lea eax, dword [local_8h]
|           0x0804843f      0110           add dword [eax], edx
|           0x08048441      8b45f8         mov eax, dword [local_8h]
|           0x08048444      0faf45f8       imul eax, dword [local_8h]
|           0x08048448      8945f4         mov dword [local_ch], eax
|           0x0804844b      8b45fc         mov eax, dword [local_4h]
|           0x0804844e      3b45f4         cmp eax, dword [local_ch]
|       ,=&lt; 0x08048451      750e           jne 0x8048461
|       |   0x08048453      c704246f8504.  mov dword [esp], str.Password_OK_: ; [0x804856f:4]=0x73736150 ; "Password OK :)\n" ; const char *format
|       |   0x0804845a      e8bdfeffff     call sym.imp.printf         ; int printf(const char *format)
|      ,==&lt; 0x0804845f      eb0c           jmp 0x804846d
|      ||   ; CODE XREF from main (0x8048451)
|      |`-&gt; 0x08048461      c704247f8504.  mov dword [esp], str.Invalid_Password ; [0x804857f:4]=0x61766e49 ; "Invalid Password!\n" ; const char *format
|      |    0x08048468      e8affeffff     call sym.imp.printf         ; int printf(const char *format)
|      |    ; CODE XREF from main (0x804845f)
|      `--&gt; 0x0804846d      b800000000     mov eax, 0
|           0x08048472      c9             leave
\           0x08048473      c3             ret

</pre>
<p>
Here it looks it moves a value into the <code>eax</code> register at runtime and then jumps if not equal to the value, lets try to find that value of the <code>eax</code> register at runtime.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"test"</span> | <span style="font-style: italic;">\</span>
    r2 -AAA ./crackme0x02 -d -c <span style="font-style: italic;">"db 0x0804844b"</span> -c <span style="font-style: italic;">"dc"</span> -c <span style="font-style: italic;">"dr"</span>
</pre>
</div>

<pre class="example" id="orgc3a23f0">
eax = 0x00052b24
ebx = 0x00000000
ecx = 0x00000000
edx = 0x000001ec
esi = 0xf7ee0000
edi = 0xf7ee0000
esp = 0xff9c4410
ebp = 0xff9c4438
eip = 0x0804844b
eflags = 0x00000206
oeax = 0xffffffff
</pre>
<p>
Now to get the <code>int32</code> value of the <code>eax</code> register value.
</p>
<div class="org-src-container">
<pre class="src src-shell">r2 -c <span style="font-style: italic;">"? 0x00052b24"</span> -- | grep int32
</pre>
</div>

<pre class="example">
int32   338724
</pre>


<p>
Time to see if this was correct
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold;">echo</span> <span style="font-style: italic;">"338724"</span> | ./crackme0x02
</pre>
</div>

<pre class="example">
IOLI Crackme Level 0x02
Password: 
Password OK :)
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
